INSTRUCTIONS = {
    # Реєстрація (18+)
    "ПУМБ": {
        "register": [
            {
                "text": "📌 Крок 1.Скиньте три скріна з дії, як на прикладі:",
                "images": ["images/pumb_change_diya1.jpg", "images/pumb_change_diya2.jpg", "images/pumb_change_diya2.jpg"],
                "age": 18
            }
        ],
        "change": [
            {
                "text": "📌 Крок 1.Скиньте три скріна з дії, як на прикладі:",
                "images": ["images/pumb_change_diya1.jpg", "images/pumb_change_diya2.jpg", "images/pumb_change_diya2.jpg"],
                "age": 18
            },
            {
                "text": "📌 Крок 2. Відкрийте додаток, зайдіть в головне меню та скиньте скріни карти з CVV, як на прикладі:",
                "images": ["images/pumb_change_card1", "images/pumb_change_card2"]
            },
            {
                "text": "📌 Крок 3. Заповніть свої особисті дані, вказані в паспорті.",
                "images": []
            },
            {
                "text": "📌 Крок 4. Підтвердіть номер телефону через SMS.",
                "images": []
            },
            {
                "text": "📌 Крок 5. Дочекайтесь верифікації акаунта, яка може зайняти до 24 годин.",
                "images": []
            }
        ]
    },
    "А-Банк": {
        "register": [
            {
                "text": "📌 Інструкція для А-Банк (Реєстрація)",
                "images": [],
                "age": 24
            }
        ],
        "change": [
            {
                "text": "📌 Інструкція для А-Банк (Перевʼяз)",
                "images": [],
                "age": 24
            }
        ]
    },
    "Фрі Банк": {
        "register": [
            {
                "text": "📌 Інструкція для Фрі Банк (Реєстрація)",
                "images": [],
                "age": 18
            }
        ]
    },
    "Акорд Банк": {
        "register": [
            {
                "text": "📌 Інструкція для Акорд Банк (Реєстрація)",
                "images": [],
                "age": 18
            }
        ]
    },
    "Вин Банк": {
        "register": [
            {
                "text": "📌 Інструкція для Вин Банк (Реєстрація)",
                "images": [],
                "age": 18
            }
        ]
    },
    "Ізі Банк": {
        "register": [
            {
                "text": "📌 Інструкція для Ізі Банк (Реєстрація)",
                "images": [],
                "age": 18
            }
        ],
        "change": [
            {
                "text": "📌 Інструкція для Ізі Банк (Перевʼяз)",
                "images": [],
                "age": 18
            }
        ]
    },
    "Еко Банк": {
        "register": [
            {
                "text": "📌 Інструкція для Еко Банк (Реєстрація)",
                "images": [],
                "age": 18
            }
        ]
    },

    # Перев’яз (18+)
    "Банк Власний Рахунок": {
        "change": [
            {
                "text": "📌 Інструкція для Банк Власний Рахунок (Перевʼяз), вимога: банку має бути більше місяця",
                "images": [],
                "age": 18
            }
        ]
    },
}